[Killed] PublicVisibility
AccountDeletionService.php:14:5
 
 class AccountDeletionService
 {
-    public function initiateDelete(User $user, string $password): void
+    protected function initiateDelete(User $user, string $password): void
     {
         if (!Hash::check($password, $user->password)) {
killedBy: Tests\Feature\Auth\AccountDeletionTest::test_delete_account_soft_deletes_user
statusReason: 1) Tests\Feature\Auth\AccountDeletionTest::test_delete_account_soft_deletes_user
Expected response status code [200] but received 500.
Failed asserting that 500 is identical to 200.

The following exception occurred during the last request:

Error: Call to protected method App\Services\AccountDeletionService::initiateDelete() from scope App\Http\Controllers\Auth\AccountDeletionController in I:\pro

[Killed] LogicalNot
AccountDeletionService.php:16:9
 {
     public function initiateDelete(User $user, string $password): void
     {
-        if (!Hash::check($password, $user->password)) {
+        if (Hash::check($password, $user->password)) {
             throw new \InvalidArgumentException('Contrasena incorrecta.');
         }
killedBy: Tests\Feature\Auth\AccountDeletionTest::test_delete_account_soft_deletes_user
statusReason: 1) Tests\Feature\Auth\AccountDeletionTest::test_delete_account_soft_deletes_user
Expected response status code [200] but received 422.
Failed asserting that 422 is identical to 200.

I:\proyectos\SuperIA\vendor\laravel\framework\src\Illuminate\Testing\TestResponseAssert.php:45
I:\proyectos\SuperIA\vendor\laravel\framework\src\Illuminate\Testing\TestResponse.php:174
I:\proyectos\SuperIA\vendor\lara

[Killed] Throw_
AccountDeletionService.php:17:13
     public function initiateDelete(User $user, string $password): void
     {
         if (!Hash::check($password, $user->password)) {
-            throw new \InvalidArgumentException('Contrasena incorrecta.');
+            new \InvalidArgumentException('Contrasena incorrecta.');
         }
 
killedBy: Tests\Feature\Auth\AccountDeletionTest::test_delete_account_fails_with_wrong_password
statusReason: 1) Tests\Feature\Auth\AccountDeletionTest::test_delete_account_fails_with_wrong_password
Expected response status code [422] but received 200.
Failed asserting that 200 is identical to 422.

I:\proyectos\SuperIA\vendor\laravel\framework\src\Illuminate\Testing\TestResponseAssert.php:45
I:\proyectos\SuperIA\vendor\laravel\framework\src\Illuminate\Testing\TestResponse.php:174
I:\proyectos\SuperIA\tes

[Killed] MethodCallRemoval
AccountDeletionService.php:23:9
         $email = $user->email;
         $name = $user->name;
 
-        DB::transaction(function () use ($user) {
-            AccountDeletionLog::logDeletion($user->id, 'user_request');
-
-            $user->shoppingLists()->delete();
-
-            $user->incrementJwtVersion();
-
-            $user->update([
-                'scheduled_hard_delete_at' => now()->addDays(30),
-            ]);
-
-            $user->delete();
-        });
+        
 
         Mail::to($email)->queue(new AccountDeletionMail($name));
killedBy: Tests\Feature\Auth\AccountDeletionTest::test_delete_account_soft_deletes_user
statusReason: 1) Tests\Feature\Auth\AccountDeletionTest::test_delete_account_soft_deletes_user
Failed asserting that any soft deleted row in the table [users] matches the attributes {"id":30685}.

Found: [
    {
        "id": 145,
        "name": "pelrock",
        "email": "pelrock@gmail.com",

[Killed] MethodCallRemoval
AccountDeletionService.php:24:13
         $name = $user->name;
 
         DB::transaction(function () use ($user) {
-            AccountDeletionLog::logDeletion($user->id, 'user_request');
+            
 
             $user->shoppingLists()->delete();
killedBy: Tests\Feature\Auth\AccountDeletionTest::test_delete_account_creates_audit_log
statusReason: 1) Tests\Feature\Auth\AccountDeletionTest::test_delete_account_creates_audit_log
Failed asserting that a row in the table [account_deletion_logs] matches the attributes {
    "hashed_user_id": "2179752894ab4b6d13315483eae4f57005b73cd921dedb1da4059268265f6be0",
    "reason": "user_request"
}.

The table is empty.

[Killed] MethodCallRemoval
AccountDeletionService.php:26:13
         DB::transaction(function () use ($user) {
             AccountDeletionLog::logDeletion($user->id, 'user_request');
 
-            $user->shoppingLists()->delete();
+            
 
             $user->incrementJwtVersion();
killedBy: Tests\Unit\Services\AccountDeletionServiceTest::test_initiate_delete_removes_shopping_lists
statusReason: 1) Tests\Unit\Services\AccountDeletionServiceTest::test_initiate_delete_removes_shopping_lists
Failed asserting that a row in the table [shopping_lists] does not match the attributes {
    "user_id": 30653
}.

Found similar results: [
    {
        "user_id": 30653

[Killed] MethodCallRemoval
AccountDeletionService.php:28:13
 
             $user->shoppingLists()->delete();
 
-            $user->incrementJwtVersion();
+            
 
             $user->update([
killedBy: Tests\Feature\Auth\AccountDeletionTest::test_delete_account_increments_jwt_version
statusReason: 1) Tests\Feature\Auth\AccountDeletionTest::test_delete_account_increments_jwt_version
Failed asserting that 0 matches expected 1.

I:\proyectos\SuperIA\tests\Feature\Auth\AccountDeletionTest.php:85

FAILURES!
Tests: 4, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
AccountDeletionService.php:30:13
 
             $user->incrementJwtVersion();
 
-            $user->update([
-                'scheduled_hard_delete_at' => now()->addDays(30),
-            ]);
+            
 
             $user->delete();
killedBy: Tests\Feature\Auth\AccountDeletionTest::test_delete_account_soft_deletes_user
statusReason: 1) Tests\Feature\Auth\AccountDeletionTest::test_delete_account_soft_deletes_user
Failed asserting that null is not null.

I:\proyectos\SuperIA\tests\Feature\Auth\AccountDeletionTest.php:41

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] ArrayItemRemoval
AccountDeletionService.php:30:13
 
             $user->incrementJwtVersion();
 
-            $user->update([
-                'scheduled_hard_delete_at' => now()->addDays(30),
-            ]);
+            $user->update([]);
 
             $user->delete();
killedBy: Tests\Feature\Auth\AccountDeletionTest::test_delete_account_soft_deletes_user
statusReason: 1) Tests\Feature\Auth\AccountDeletionTest::test_delete_account_soft_deletes_user
Failed asserting that null is not null.

I:\proyectos\SuperIA\tests\Feature\Auth\AccountDeletionTest.php:41

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] IncrementInteger
AccountDeletionService.php:31:17
             $user->incrementJwtVersion();
 
             $user->update([
-                'scheduled_hard_delete_at' => now()->addDays(30),
+                'scheduled_hard_delete_at' => now()->addDays(31),
             ]);
 
killedBy: Tests\Unit\Services\AccountDeletionServiceTest::test_initiate_delete_schedules_hard_delete_in_exactly_30_days
statusReason: 1) Tests\Unit\Services\AccountDeletionServiceTest::test_initiate_delete_schedules_hard_delete_in_exactly_30_days
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'2026-05-23'
+'2026-05-24'

[Killed] DecrementInteger
AccountDeletionService.php:31:17
             $user->incrementJwtVersion();
 
             $user->update([
-                'scheduled_hard_delete_at' => now()->addDays(30),
+                'scheduled_hard_delete_at' => now()->addDays(29),
             ]);
 
killedBy: Tests\Unit\Services\AccountDeletionServiceTest::test_initiate_delete_schedules_hard_delete_in_exactly_30_days
statusReason: 1) Tests\Unit\Services\AccountDeletionServiceTest::test_initiate_delete_schedules_hard_delete_in_exactly_30_days
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'2026-05-23'
+'2026-05-22'

[Killed] MethodCallRemoval
AccountDeletionService.php:37:9
             $user->delete();
         });
 
-        Mail::to($email)->queue(new AccountDeletionMail($name));
+        
     }
 
killedBy: Tests\Feature\Auth\AccountDeletionTest::test_delete_account_sends_confirmation_email
statusReason: 1) Tests\Feature\Auth\AccountDeletionTest::test_delete_account_sends_confirmation_email
The expected [App\Mail\AccountDeletionMail] mailable was not queued.
Failed asserting that false is true.

I:\proyectos\SuperIA\vendor\laravel\framework\src\Illuminate\Support\Testing\Fakes\MailFake.php:215
I:\proyectos\SuperIA\vendor\laravel\framework\src\Illuminate\Support\Facades\Facade.php:363
I:\proyectos\

[Killed] PublicVisibility
AccountDeletionService.php:40:5
         Mail::to($email)->queue(new AccountDeletionMail($name));
     }
 
-    public function hardDeleteExpiredAccounts(): int
+    protected function hardDeleteExpiredAccounts(): int
     {
         $users = User::onlyTrashed()
killedBy: Tests\Unit\Services\AccountDeletionServiceTest::test_hard_delete_expired_accounts_removes_users
statusReason: 1) Tests\Unit\Services\AccountDeletionServiceTest::test_hard_delete_expired_accounts_removes_users
Error: Call to protected method App\Services\AccountDeletionService::hardDeleteExpiredAccounts() from scope Tests\Unit\Services\AccountDeletionServiceTest

I:\proyectos\SuperIA\tests\Unit\Services\AccountDeletionServiceTest.php:100

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Foreach_
AccountDeletionService.php:49:9
 
         $count = 0;
 
-        foreach ($users as $user) {
-            $user->forceDelete();
-            $count++;
-        }
+        foreach ([] as $user) {
 
         return $count;
killedBy: Tests\Unit\Services\AccountDeletionServiceTest::test_hard_delete_expired_accounts_removes_users
statusReason: 1) Tests\Unit\Services\AccountDeletionServiceTest::test_hard_delete_expired_accounts_removes_users
Failed asserting that 0 matches expected 1.

I:\proyectos\SuperIA\tests\Unit\Services\AccountDeletionServiceTest.php:102

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
AccountDeletionService.php:50:13
         $count = 0;
 
         foreach ($users as $user) {
-            $user->forceDelete();
+            
             $count++;
         }
killedBy: Tests\Unit\Services\AccountDeletionServiceTest::test_hard_delete_expired_accounts_removes_users
statusReason: 1) Tests\Unit\Services\AccountDeletionServiceTest::test_hard_delete_expired_accounts_removes_users
Failed asserting that a row in the table [users] does not match the attributes {
    "id": 30690
}.

Found similar results: [
    {
        "id": 30690

[Killed] Increment
AccountDeletionService.php:51:13
 
         foreach ($users as $user) {
             $user->forceDelete();
-            $count++;
+            $count--;
         }
 
killedBy: Tests\Unit\Services\AccountDeletionServiceTest::test_hard_delete_expired_accounts_removes_users
statusReason: 1) Tests\Unit\Services\AccountDeletionServiceTest::test_hard_delete_expired_accounts_removes_users
Failed asserting that -1 matches expected 1.

I:\proyectos\SuperIA\tests\Unit\Services\AccountDeletionServiceTest.php:102

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
