[Killed] PublicVisibility
ActivityLogService.php:36:5
         return $log;
     }
 
-    public function getRecent(ShoppingList $list, int $limit = self::MAX_ENTRIES_PER_LIST): Collection
+    protected function getRecent(ShoppingList $list, int $limit = self::MAX_ENTRIES_PER_LIST): Collection
     {
         return ListActivityLog::where('shopping_list_id', $list->id)
killedBy: Tests\Unit\Services\ActivityLogServiceTest::test_get_recent_returns_newest_first
statusReason: 1) Tests\Unit\Services\ActivityLogServiceTest::test_get_recent_returns_newest_first
Error: Call to protected method App\Services\ActivityLogService::getRecent() from scope Tests\Unit\Services\ActivityLogServiceTest

I:\proyectos\SuperIA\tests\Unit\Services\ActivityLogServiceTest.php:117

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
ActivityLogService.php:52:13
             ->value('id');
 
         if ($thresholdId !== null) {
-            ListActivityLog::where('shopping_list_id', $listId)
-                ->where('id', '<=', $thresholdId)
-                ->delete();
+            
         }
     }
killedBy: Tests\Unit\Services\ActivityLogServiceTest::test_rolling_limit_keeps_only_latest_50
statusReason: 1) Tests\Unit\Services\ActivityLogServiceTest::test_rolling_limit_keeps_only_latest_50
Failed asserting that 60 matches expected 50.

I:\proyectos\SuperIA\tests\Unit\Services\ActivityLogServiceTest.php:90

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
