[Killed] PublicVisibility
AdminMetricsService.php:15:5
 
 class AdminMetricsService
 {
-    public function getMetrics(): array
+    protected function getMetrics(): array
     {
         $tz = config('ai.timezone', 'Europe/Madrid');
killedBy: Tests\Unit\Services\AdminMetricsServiceTest::test_returns_user_counts
statusReason: 1) Tests\Unit\Services\AdminMetricsServiceTest::test_returns_user_counts
Error: Call to protected method App\Services\AdminMetricsService::getMetrics() from scope Tests\Unit\Services\AdminMetricsServiceTest

I:\proyectos\SuperIA\tests\Unit\Services\AdminMetricsServiceTest.php:31

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Survived] IncrementInteger
AdminMetricsService.php:19:9
     {
         $tz = config('ai.timezone', 'Europe/Madrid');
         $today = Carbon::now($tz)->toDateString();
-        $sevenDaysAgo = Carbon::now($tz)->subDays(7);
+        $sevenDaysAgo = Carbon::now($tz)->subDays(8);
         $monthStart = Carbon::now($tz)->startOfMonth();
 

[Survived] DecrementInteger
AdminMetricsService.php:19:9
     {
         $tz = config('ai.timezone', 'Europe/Madrid');
         $today = Carbon::now($tz)->toDateString();
-        $sevenDaysAgo = Carbon::now($tz)->subDays(7);
+        $sevenDaysAgo = Carbon::now($tz)->subDays(6);
         $monthStart = Carbon::now($tz)->startOfMonth();
 

[Killed] DecrementInteger
AdminMetricsService.php:29:13
             'lists_total' => ShoppingList::count(),
             'ai_calls_today' => AiUsageLog::where('date', $today)->where('status', AiUsageStatus::Success->value)->count(),
             'ai_calls_month' => AiUsageLog::where('date', '>=', $monthStart->toDateString())->where('status', AiUsageStatus::Success->value)->count(),
-            'ai_cost_month' => round((float) AiUsageLog::where('date', '>=', $monthStart->toDateString())->where('status', AiUsageStatus::Success->value)->sum('estimated_cost_usd'), 2),
+            'ai_cost_month' => round((float) AiUsageLog::where('date', '>=', $monthStart->toDateString())->where('status', AiUsageStatus::Success->value)->sum('estimated_cost_usd'), 1),
             'waitlist_pending' => WaitlistEntry::where('status', 'pending')->count(),
         ];
killedBy: Tests\Unit\Services\AdminMetricsServiceTest::test_ai_cost_month_is_float_rounded_to_2_decimals
statusReason: 1) Tests\Unit\Services\AdminMetricsServiceTest::test_ai_cost_month_is_float_rounded_to_2_decimals
Failed asserting that 1.1 is identical to 1.06.

I:\proyectos\SuperIA\tests\Unit\Services\AdminMetricsServiceTest.php:115

FAILURES!
Tests: 7, Assertions: 21, Failures: 1.

[Killed] IncrementInteger
AdminMetricsService.php:29:13
             'lists_total' => ShoppingList::count(),
             'ai_calls_today' => AiUsageLog::where('date', $today)->where('status', AiUsageStatus::Success->value)->count(),
             'ai_calls_month' => AiUsageLog::where('date', '>=', $monthStart->toDateString())->where('status', AiUsageStatus::Success->value)->count(),
-            'ai_cost_month' => round((float) AiUsageLog::where('date', '>=', $monthStart->toDateString())->where('status', AiUsageStatus::Success->value)->sum('estimated_cost_usd'), 2),
+            'ai_cost_month' => round((float) AiUsageLog::where('date', '>=', $monthStart->toDateString())->where('status', AiUsageStatus::Success->value)->sum('estimated_cost_usd'), 3),
             'waitlist_pending' => WaitlistEntry::where('status', 'pending')->count(),
         ];
killedBy: Tests\Unit\Services\AdminMetricsServiceTest::test_ai_cost_month_is_float_rounded_to_2_decimals
statusReason: 1) Tests\Unit\Services\AdminMetricsServiceTest::test_ai_cost_month_is_float_rounded_to_2_decimals
Failed asserting that 1.063 is identical to 1.06.

I:\proyectos\SuperIA\tests\Unit\Services\AdminMetricsServiceTest.php:115

FAILURES!
Tests: 7, Assertions: 21, Failures: 1.

[Survived] CastInt
AdminMetricsService.php:36:9
 
     private function activeUsersLast7Days(Carbon $since): int
     {
-        return (int) DB::table('producto_historial')
-            ->where('fecha_compra', '>=', $since)
-            ->distinct('user_id')
-            ->count('user_id');
+        return DB::table('producto_historial')
     }
 }
