[Killed] ReturnRemoval
AuthService.php:18:13
     public function login(string $email, string $password, string $ipAddress, bool $remember = false): array
     {
         if ($this->isLockedOut($email)) {
-            return [
-                'success' => false,
-                'error' => 'ACCOUNT_LOCKED',
-                'message' => 'Cuenta bloqueada temporalmente. Intentalo de nuevo en 15 minutos.',
-            ];
+            
         }
 
killedBy: Tests\Unit\Services\AuthServiceTest::test_login_returns_error_when_locked
statusReason: 1) Tests\Unit\Services\AuthServiceTest::test_login_returns_error_when_locked
Failed asserting that true is false.

I:\proyectos\SuperIA\tests\Unit\Services\AuthServiceTest.php:71

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] FalseValue
AuthService.php:19:17
     {
         if ($this->isLockedOut($email)) {
             return [
-                'success' => false,
+                'success' => true,
                 'error' => 'ACCOUNT_LOCKED',
                 'message' => 'Cuenta bloqueada temporalmente. Intentalo de nuevo en 15 minutos.',
killedBy: Tests\Unit\Services\AuthServiceTest::test_login_returns_error_when_locked
statusReason: 1) Tests\Unit\Services\AuthServiceTest::test_login_returns_error_when_locked
Failed asserting that true is false.

I:\proyectos\SuperIA\tests\Unit\Services\AuthServiceTest.php:71

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
AuthService.php:28:13
         $user = User::where('email', $email)->first();
 
         if (!$user || !Hash::check($password, $user->password)) {
-            LoginAttempt::record($email, $ipAddress);
+            
 
             return [
killedBy: Tests\Unit\Services\AuthServiceTest::test_login_returns_error_for_wrong_password
statusReason: 1) Tests\Unit\Services\AuthServiceTest::test_login_returns_error_for_wrong_password
Failed asserting that 0 matches expected 1.

I:\proyectos\SuperIA\tests\Unit\Services\AuthServiceTest.php:83

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] ReturnRemoval
AuthService.php:30:13
         if (!$user || !Hash::check($password, $user->password)) {
             LoginAttempt::record($email, $ipAddress);
 
-            return [
-                'success' => false,
-                'error' => 'INVALID_CREDENTIALS',
-                'message' => 'Credenciales incorrectas.',
-            ];
+            
         }
 
killedBy: Tests\Unit\Services\AuthServiceTest::test_login_returns_error_for_wrong_password
statusReason: 1) Tests\Unit\Services\AuthServiceTest::test_login_returns_error_for_wrong_password
Failed asserting that true is false.

I:\proyectos\SuperIA\tests\Unit\Services\AuthServiceTest.php:81

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] ReturnRemoval
AuthService.php:38:13
         }
 
         if (!$user->is_active) {
-            return [
-                'success' => false,
-                'error' => 'ACCOUNT_DEACTIVATED',
-                'message' => 'Tu cuenta ha sido desactivada.',
-            ];
+            
         }
 
killedBy: Tests\Feature\AdminDeactivateUserTest::test_deactivated_user_cannot_login
statusReason: 1) Tests\Feature\AdminDeactivateUserTest::test_deactivated_user_cannot_login
Failed asserting that true is false.

I:\proyectos\SuperIA\tests\Feature\AdminDeactivateUserTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] ReturnRemoval
AuthService.php:46:13
         }
 
         if (!$user->email_verified_at) {
-            return [
-                'success' => false,
-                'error' => 'EMAIL_NOT_VERIFIED',
-                'message' => 'Debes verificar tu email antes de iniciar sesión.',
-            ];
+            
         }
 
killedBy: Tests\Unit\Services\AuthServiceTest::test_login_returns_error_for_unverified_email
statusReason: 1) Tests\Unit\Services\AuthServiceTest::test_login_returns_error_for_unverified_email
Failed asserting that true is false.

I:\proyectos\SuperIA\tests\Unit\Services\AuthServiceTest.php:92

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
AuthService.php:68:5
         ];
     }
 
-    public function logout(): void
+    protected function logout(): void
     {
         JWTAuth::invalidate(JWTAuth::getToken());
killedBy: Tests\Unit\Services\AuthServiceTest::test_logout_invalidates_jwt_token
statusReason: 1) Tests\Unit\Services\AuthServiceTest::test_logout_invalidates_jwt_token
Error: Call to protected method App\Services\AuthService::logout() from scope Tests\Unit\Services\AuthServiceTest

I:\proyectos\SuperIA\tests\Unit\Services\AuthServiceTest.php:122

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
AuthService.php:70:9
 
     public function logout(): void
     {
-        JWTAuth::invalidate(JWTAuth::getToken());
+        
 
         // Also invalidate any web/backpack session to prevent stale session
killedBy: Tests\Unit\Services\AuthServiceTest::test_logout_invalidates_jwt_token
statusReason: 1) Tests\Unit\Services\AuthServiceTest::test_logout_invalidates_jwt_token
Failed asserting that exception of type "Tymon\JWTAuth\Exceptions\TokenInvalidException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] IfNegation
AuthService.php:74:9
 
         // Also invalidate any web/backpack session to prevent stale session
         // from redirecting admin/login away (guard shares session driver).
-        if (request()->hasSession()) {
-            request()->session()->invalidate();
-            request()->session()->regenerateToken();
-        }
+        if (!request()->hasSession()) {
     }
 
killedBy: Tests\Unit\Services\AuthServiceTest::test_logout_invalidates_jwt_token
statusReason: 1) Tests\Unit\Services\AuthServiceTest::test_logout_invalidates_jwt_token
RuntimeException: Session store not set on request.

I:\proyectos\SuperIA\vendor\laravel\framework\src\Illuminate\Http\Request.php:610
I:\proyectos\SuperIA\app\Services\AuthService.php:75
I:\proyectos\SuperIA\tests\Unit\Services\AuthServiceTest.php:122

ERRORS!

[Killed] PublicVisibility
AuthService.php:80:5
         }
     }
 
-    public function refresh(): string
+    protected function refresh(): string
     {
         return JWTAuth::refresh(JWTAuth::getToken());
killedBy: Tests\Feature\Auth\LoginTest::test_refresh_returns_new_token
statusReason: 1) Tests\Feature\Auth\LoginTest::test_refresh_returns_new_token
Expected response status code [200] but received 500.
Failed asserting that 500 is identical to 200.

The following exception occurred during the last request:

Error: Call to protected method App\Services\AuthService::refresh() from scope App\Http\Controllers\Auth\LoginController in I:\proyectos\SuperIA\app\Http\Controllers\Auth\Logi
