[Killed] PublicVisibility
CollaboratorPresenceService.php:36:5
         return $session;
     }
 
-    public function countActive(ShoppingList $list): int
+    protected function countActive(ShoppingList $list): int
     {
         return Cache::remember(
killedBy: Tests\Unit\Services\CollaboratorPresenceServiceTest::test_count_active_includes_recent_sessions
statusReason: 1) Tests\Unit\Services\CollaboratorPresenceServiceTest::test_count_active_includes_recent_sessions
Error: Call to protected method App\Services\CollaboratorPresenceService::countActive() from scope Tests\Unit\Services\CollaboratorPresenceServiceTest

I:\proyectos\SuperIA\tests\Unit\Services\CollaboratorPresenceServiceTest.php:70

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
CollaboratorPresenceService.php:45:5
         );
     }
 
-    public function deleteStale(): int
+    protected function deleteStale(): int
     {
         $threshold = Carbon::now()->subMinutes(self::STALE_CLEANUP_MINUTES);
killedBy: Tests\Unit\Services\CollaboratorPresenceServiceTest::test_delete_stale_removes_old_sessions
statusReason: 1) Tests\Unit\Services\CollaboratorPresenceServiceTest::test_delete_stale_removes_old_sessions
Error: Call to protected method App\Services\CollaboratorPresenceService::deleteStale() from scope Tests\Unit\Services\CollaboratorPresenceServiceTest

I:\proyectos\SuperIA\tests\Unit\Services\CollaboratorPresenceServiceTest.php:156

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
