[Survived] Continue_
ComplementarySuggestionService.php:109:17
         foreach ($rows as $row) {
             $ratio = (int) $row->co_count / $listsWithXCount;
             if ($ratio < $threshold) {
-                continue;
+                break;
             }
 

[Killed] Continue_
ComplementarySuggestionService.php:114:17
 
             $key = mb_strtolower($row->producto_nombre);
             if (isset($currentListLower[$key])) {
-                continue;
+                break;
             }
 
killedBy: Tests\Unit\Services\ComplementarySuggestionServiceTest::test_co_occurrence_continues_past_current_list_item_to_next_candidate
statusReason: 1) Tests\Unit\Services\ComplementarySuggestionServiceTest::test_co_occurrence_continues_past_current_list_item_to_next_candidate
Failed asserting that an array contains 'Sal'.

I:\proyectos\SuperIA\tests\Unit\Services\ComplementarySuggestionServiceTest.php:423

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] MethodCallRemoval
ComplementarySuggestionService.php:139:13
     private function tryAiFallback(User $user, string $productName, array $currentListLower): array
     {
         if (! $this->budgetCap->canSpend()) {
-            $this->usageTracker->record($user, AiOperation::Complement, AiUsageStatus::BudgetCapped);
+            
             $this->budgetCap->notifyIfExceeded();
             return ['suggestions' => [], 'ai_fallback_used' => false, 'ai_limit_reached' => true];
killedBy: Tests\Unit\Services\ComplementarySuggestionServiceTest::test_budget_cap_blocks_ai_fallback
statusReason: 1) Tests\Unit\Services\ComplementarySuggestionServiceTest::test_budget_cap_blocks_ai_fallback
Failed asserting that a row in the table [ai_usage_log] matches the attributes {
    "user_id": 30781,
    "status": "budget_capped",
    "operation": "complement"
}.

Found similar results: [

[Survived] MethodCallRemoval
ComplementarySuggestionService.php:140:13
     {
         if (! $this->budgetCap->canSpend()) {
             $this->usageTracker->record($user, AiOperation::Complement, AiUsageStatus::BudgetCapped);
-            $this->budgetCap->notifyIfExceeded();
+            
             return ['suggestions' => [], 'ai_fallback_used' => false, 'ai_limit_reached' => true];
         }

[Killed] FalseValue
ComplementarySuggestionService.php:141:13
         if (! $this->budgetCap->canSpend()) {
             $this->usageTracker->record($user, AiOperation::Complement, AiUsageStatus::BudgetCapped);
             $this->budgetCap->notifyIfExceeded();
-            return ['suggestions' => [], 'ai_fallback_used' => false, 'ai_limit_reached' => true];
+            return ['suggestions' => [], 'ai_fallback_used' => true, 'ai_limit_reached' => true];
         }
 
killedBy: Tests\Unit\Services\ComplementarySuggestionServiceTest::test_budget_cap_returns_empty_suggestions_and_false_ai_fallback
statusReason: 1) Tests\Unit\Services\ComplementarySuggestionServiceTest::test_budget_cap_returns_empty_suggestions_and_false_ai_fallback
Failed asserting that true is false.

I:\proyectos\SuperIA\tests\Unit\Services\ComplementarySuggestionServiceTest.php:330

FAILURES!
Tests: 2, Assertions: 4, Failures: 1.

[Killed] ReturnRemoval
ComplementarySuggestionService.php:141:13
         if (! $this->budgetCap->canSpend()) {
             $this->usageTracker->record($user, AiOperation::Complement, AiUsageStatus::BudgetCapped);
             $this->budgetCap->notifyIfExceeded();
-            return ['suggestions' => [], 'ai_fallback_used' => false, 'ai_limit_reached' => true];
+            
         }
 
killedBy: Tests\Unit\Services\ComplementarySuggestionServiceTest::test_budget_cap_blocks_ai_fallback
statusReason: 1) Tests\Unit\Services\ComplementarySuggestionServiceTest::test_budget_cap_blocks_ai_fallback
Failed asserting that false is true.

I:\proyectos\SuperIA\tests\Unit\Services\ComplementarySuggestionServiceTest.php:191

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
ComplementarySuggestionService.php:145:13
         }
 
         if (! $this->usageTracker->canUse($user, AiOperation::Complement)) {
-            $this->usageTracker->record($user, AiOperation::Complement, AiUsageStatus::UserCapped);
+            
             return ['suggestions' => [], 'ai_fallback_used' => false, 'ai_limit_reached' => true];
         }
killedBy: Tests\Unit\Services\ComplementarySuggestionServiceTest::test_user_quota_records_user_capped_and_returns_empty_suggestions
statusReason: 1) Tests\Unit\Services\ComplementarySuggestionServiceTest::test_user_quota_records_user_capped_and_returns_empty_suggestions
Failed asserting that a row in the table [ai_usage_log] matches the attributes {
    "user_id": 30792,
    "status": "user_capped",
    "operation": "complement"
}.

Found similar results: [

[Killed] TrueValue
ComplementarySuggestionService.php:146:13
 
         if (! $this->usageTracker->canUse($user, AiOperation::Complement)) {
             $this->usageTracker->record($user, AiOperation::Complement, AiUsageStatus::UserCapped);
-            return ['suggestions' => [], 'ai_fallback_used' => false, 'ai_limit_reached' => true];
+            return ['suggestions' => [], 'ai_fallback_used' => false, 'ai_limit_reached' => false];
         }
 
killedBy: Tests\Unit\Services\ComplementarySuggestionServiceTest::test_user_quota_blocks_ai_fallback
statusReason: 1) Tests\Unit\Services\ComplementarySuggestionServiceTest::test_user_quota_blocks_ai_fallback
Failed asserting that false is true.

I:\proyectos\SuperIA\tests\Unit\Services\ComplementarySuggestionServiceTest.php:211

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] ReturnRemoval
ComplementarySuggestionService.php:146:13
 
         if (! $this->usageTracker->canUse($user, AiOperation::Complement)) {
             $this->usageTracker->record($user, AiOperation::Complement, AiUsageStatus::UserCapped);
-            return ['suggestions' => [], 'ai_fallback_used' => false, 'ai_limit_reached' => true];
+            
         }
 
killedBy: Tests\Unit\Services\ComplementarySuggestionServiceTest::test_user_quota_blocks_ai_fallback
statusReason: 1) Tests\Unit\Services\ComplementarySuggestionServiceTest::test_user_quota_blocks_ai_fallback
Failed asserting that false is true.

I:\proyectos\SuperIA\tests\Unit\Services\ComplementarySuggestionServiceTest.php:211

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
ComplementarySuggestionService.php:150:13
         }
 
         if (! $this->circuitBreaker->allow()) {
-            $this->usageTracker->record($user, AiOperation::Complement, AiUsageStatus::CircuitOpen);
+            
             return ['suggestions' => [], 'ai_fallback_used' => false, 'ai_limit_reached' => true];
         }
killedBy: Tests\Unit\Services\ComplementarySuggestionServiceTest::test_circuit_open_records_circuit_open_log_and_returns_empty_suggestions
statusReason: 1) Tests\Unit\Services\ComplementarySuggestionServiceTest::test_circuit_open_records_circuit_open_log_and_returns_empty_suggestions
Failed asserting that a row in the table [ai_usage_log] matches the attributes {
    "user_id": 30799,
    "status": "circuit_open",
    "operation": "complement"
}.

Found similar results: [

[Killed] FalseValue
ComplementarySuggestionService.php:151:13
 
         if (! $this->circuitBreaker->allow()) {
             $this->usageTracker->record($user, AiOperation::Complement, AiUsageStatus::CircuitOpen);
-            return ['suggestions' => [], 'ai_fallback_used' => false, 'ai_limit_reached' => true];
+            return ['suggestions' => [], 'ai_fallback_used' => true, 'ai_limit_reached' => true];
         }
 
killedBy: Tests\Unit\Services\ComplementarySuggestionServiceTest::test_circuit_breaker_opens_after_complement_claude_failures
statusReason: 1) Tests\Unit\Services\ComplementarySuggestionServiceTest::test_circuit_breaker_opens_after_complement_claude_failures
Failed asserting that true is false.

I:\proyectos\SuperIA\tests\Unit\Services\ComplementarySuggestionServiceTest.php:381

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] ReturnRemoval
ComplementarySuggestionService.php:151:13
 
         if (! $this->circuitBreaker->allow()) {
             $this->usageTracker->record($user, AiOperation::Complement, AiUsageStatus::CircuitOpen);
-            return ['suggestions' => [], 'ai_fallback_used' => false, 'ai_limit_reached' => true];
+            
         }
 
killedBy: Tests\Unit\Services\ComplementarySuggestionServiceTest::test_circuit_breaker_opens_after_complement_claude_failures
statusReason: 1) Tests\Unit\Services\ComplementarySuggestionServiceTest::test_circuit_breaker_opens_after_complement_claude_failures
Failed asserting that false is true.

I:\proyectos\SuperIA\tests\Unit\Services\ComplementarySuggestionServiceTest.php:380

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
ComplementarySuggestionService.php:168:13
                 $result['output_tokens'] ?? null,
             );
         } catch (ClaudeException $e) {
-            $this->circuitBreaker->recordFailure();
+            
             $this->usageTracker->record($user, AiOperation::Complement, AiUsageStatus::Error);
             return ['suggestions' => [], 'ai_fallback_used' => false, 'ai_limit_reached' => false];
killedBy: Tests\Unit\Services\ComplementarySuggestionServiceTest::test_circuit_breaker_opens_after_complement_claude_failures
statusReason: 1) Tests\Unit\Services\ComplementarySuggestionServiceTest::test_circuit_breaker_opens_after_complement_claude_failures
Failed asserting that false is true.

I:\proyectos\SuperIA\tests\Unit\Services\ComplementarySuggestionServiceTest.php:380

FAILURES!
Tests: 3, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
ComplementarySuggestionService.php:169:13
             );
         } catch (ClaudeException $e) {
             $this->circuitBreaker->recordFailure();
-            $this->usageTracker->record($user, AiOperation::Complement, AiUsageStatus::Error);
+            
             return ['suggestions' => [], 'ai_fallback_used' => false, 'ai_limit_reached' => false];
         }
killedBy: Tests\Unit\Services\ComplementarySuggestionServiceTest::test_claude_error_returns_empty_without_crash
statusReason: 1) Tests\Unit\Services\ComplementarySuggestionServiceTest::test_claude_error_returns_empty_without_crash
Failed asserting that a row in the table [ai_usage_log] matches the attributes {
    "user_id": 30806,
    "operation": "complement",
    "status": "error"
}.

Found: [

[Killed] FalseValue
ComplementarySuggestionService.php:170:13
         } catch (ClaudeException $e) {
             $this->circuitBreaker->recordFailure();
             $this->usageTracker->record($user, AiOperation::Complement, AiUsageStatus::Error);
-            return ['suggestions' => [], 'ai_fallback_used' => false, 'ai_limit_reached' => false];
+            return ['suggestions' => [], 'ai_fallback_used' => true, 'ai_limit_reached' => false];
         }
 
killedBy: Tests\Unit\Services\ComplementarySuggestionServiceTest::test_claude_error_returns_empty_without_crash
statusReason: 1) Tests\Unit\Services\ComplementarySuggestionServiceTest::test_claude_error_returns_empty_without_crash
Failed asserting that true is false.

I:\proyectos\SuperIA\tests\Unit\Services\ComplementarySuggestionServiceTest.php:223

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] FalseValue
ComplementarySuggestionService.php:170:13
         } catch (ClaudeException $e) {
             $this->circuitBreaker->recordFailure();
             $this->usageTracker->record($user, AiOperation::Complement, AiUsageStatus::Error);
-            return ['suggestions' => [], 'ai_fallback_used' => false, 'ai_limit_reached' => false];
+            return ['suggestions' => [], 'ai_fallback_used' => false, 'ai_limit_reached' => true];
         }
 
killedBy: Tests\Unit\Services\ComplementarySuggestionServiceTest::test_claude_error_returns_false_for_ai_limit_reached
statusReason: 1) Tests\Unit\Services\ComplementarySuggestionServiceTest::test_claude_error_returns_false_for_ai_limit_reached
Failed asserting that true is false.

I:\proyectos\SuperIA\tests\Unit\Services\ComplementarySuggestionServiceTest.php:362

FAILURES!
Tests: 2, Assertions: 4, Failures: 1.
