[Killed] IncrementInteger
ListGenerationService.php:95:13
     public function confirmAddToExisting(User $user, ShoppingList $list, array $items): ShoppingList
     {
         if ($list->user_id !== $user->id) {
-            abort(404);
+            abort(405);
         }
 
killedBy: Tests\Unit\Services\ListGenerationServiceTest::test_confirm_add_to_existing_throws_404_not_403_or_405
statusReason: 1) Tests\Unit\Services\ListGenerationServiceTest::test_confirm_add_to_existing_throws_404_not_403_or_405
Failed asserting that 405 is identical to 404.

I:\proyectos\SuperIA\tests\Unit\Services\ListGenerationServiceTest.php:240

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] FunctionCallRemoval
ListGenerationService.php:95:13
     public function confirmAddToExisting(User $user, ShoppingList $list, array $items): ShoppingList
     {
         if ($list->user_id !== $user->id) {
-            abort(404);
+            
         }
 
killedBy: Tests\Unit\Services\ListGenerationServiceTest::test_confirm_add_to_existing_rejects_other_users_list
statusReason: 1) Tests\Unit\Services\ListGenerationServiceTest::test_confirm_add_to_existing_rejects_other_users_list
Failed asserting that exception of type "Symfony\Component\HttpKernel\Exception\HttpException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
ListGenerationService.php:107:13
     private function checkQuotas(User $user): void
     {
         if (! $this->budgetCap->canSpend()) {
-            $this->usageTracker->record($user, AiOperation::Generation, AiUsageStatus::BudgetCapped);
+            
             $this->budgetCap->notifyIfExceeded();
             throw new \RuntimeException('BUDGET_CAPPED');
killedBy: Tests\Unit\Services\ListGenerationServiceTest::test_generate_budget_capped_records_budget_capped_in_log
statusReason: 1) Tests\Unit\Services\ListGenerationServiceTest::test_generate_budget_capped_records_budget_capped_in_log
Failed asserting that a row in the table [ai_usage_log] matches the attributes {
    "user_id": 30826,
    "status": "budget_capped",
    "operation": "generation"
}.

Found similar results: [

[Survived] MethodCallRemoval
ListGenerationService.php:108:13
     {
         if (! $this->budgetCap->canSpend()) {
             $this->usageTracker->record($user, AiOperation::Generation, AiUsageStatus::BudgetCapped);
-            $this->budgetCap->notifyIfExceeded();
+            
             throw new \RuntimeException('BUDGET_CAPPED');
         }

[Killed] Throw_
ListGenerationService.php:109:13
         if (! $this->budgetCap->canSpend()) {
             $this->usageTracker->record($user, AiOperation::Generation, AiUsageStatus::BudgetCapped);
             $this->budgetCap->notifyIfExceeded();
-            throw new \RuntimeException('BUDGET_CAPPED');
+            new \RuntimeException('BUDGET_CAPPED');
         }
 
killedBy: Tests\Unit\Services\ListGenerationServiceTest::test_generate_blocks_when_budget_exceeded
statusReason: 1) Tests\Unit\Services\ListGenerationServiceTest::test_generate_blocks_when_budget_exceeded
Failed asserting that exception of type "RuntimeException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
ListGenerationService.php:113:13
         }
 
         if (! $this->usageTracker->canUse($user, AiOperation::Generation)) {
-            $this->usageTracker->record($user, AiOperation::Generation, AiUsageStatus::UserCapped);
+            
             throw new \RuntimeException('AI_LIMIT');
         }
killedBy: Tests\Unit\Services\ListGenerationServiceTest::test_generate_user_quota_records_user_capped_in_log
statusReason: 1) Tests\Unit\Services\ListGenerationServiceTest::test_generate_user_quota_records_user_capped_in_log
Failed asserting that a row in the table [ai_usage_log] matches the attributes {
    "user_id": 30831,
    "status": "user_capped",
    "operation": "generation"
}.

Found similar results: [

[Killed] Throw_
ListGenerationService.php:114:13
 
         if (! $this->usageTracker->canUse($user, AiOperation::Generation)) {
             $this->usageTracker->record($user, AiOperation::Generation, AiUsageStatus::UserCapped);
-            throw new \RuntimeException('AI_LIMIT');
+            new \RuntimeException('AI_LIMIT');
         }
 
killedBy: Tests\Unit\Services\ListGenerationServiceTest::test_generate_blocks_when_shared_quota_exceeded
statusReason: 1) Tests\Unit\Services\ListGenerationServiceTest::test_generate_blocks_when_shared_quota_exceeded
Failed asserting that exception of type "RuntimeException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Survived] MethodCallRemoval
ListGenerationService.php:145:17
             // Silent retry once
             try {
                 $result = $this->claude->generateListFromContext($context);
-                $this->circuitBreaker->recordSuccess();
+                
                 return $result;
             } catch (ClaudeException $e2) {

[Killed] ReturnRemoval
ListGenerationService.php:146:17
             try {
                 $result = $this->claude->generateListFromContext($context);
                 $this->circuitBreaker->recordSuccess();
-                return $result;
+                
             } catch (ClaudeException $e2) {
                 $this->circuitBreaker->recordFailure();
killedBy: Tests\Unit\Services\ListGenerationServiceTest::test_generate_retries_silently_on_first_claude_failure
statusReason: 1) Tests\Unit\Services\ListGenerationServiceTest::test_generate_retries_silently_on_first_claude_failure
TypeError: App\Services\ListGenerationService::callWithRetry(): Return value must be of type array, none returned

I:\proyectos\SuperIA\app\Services\ListGenerationService.php:152
I:\proyectos\SuperIA\app\Services\ListGenerationService.php:51
I:\proyectos\SuperIA\tests\Unit\Services\ListGenerati
