[Killed] DecrementInteger
ListHistoryService.php:46:13
     public function duplicate(User $user, ShoppingList $list): ShoppingList
     {
         if ($list->user_id !== $user->id) {
-            abort(404);
+            abort(403);
         }
 
killedBy: Tests\Unit\Services\ListHistoryServiceTest::test_duplicate_aborts_when_user_does_not_own_list
statusReason: 1) Tests\Unit\Services\ListHistoryServiceTest::test_duplicate_aborts_when_user_does_not_own_list
Failed asserting that exception of type "Symfony\Component\HttpKernel\Exception\HttpException" matches expected exception "Symfony\Component\HttpKernel\Exception\NotFoundHttpException". Message was: "" at
I:\proyectos\SuperIA\vendor\laravel\framework\src\Illuminate\Foundation\Application.php:1440
I:\pr
