[Killed] PublicVisibility
ProductHistoryCleanupService.php:10:5
 
 class ProductHistoryCleanupService
 {
-    public function clearAll(User $user): int
+    protected function clearAll(User $user): int
     {
         return ProductoHistorial::where('user_id', $user->id)->delete();
killedBy: Tests\Unit\Services\ProductHistoryCleanupServiceTest::test_clear_all_deletes_only_user_rows
statusReason: 1) Tests\Unit\Services\ProductHistoryCleanupServiceTest::test_clear_all_deletes_only_user_rows
Error: Call to protected method App\Services\ProductHistoryCleanupService::clearAll() from scope Tests\Unit\Services\ProductHistoryCleanupServiceTest

I:\proyectos\SuperIA\tests\Unit\Services\ProductHistoryCleanupServiceTest.php:42

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
ProductHistoryCleanupService.php:15:5
         return ProductoHistorial::where('user_id', $user->id)->delete();
     }
 
-    public function forget(User $user, string $productName): int
+    protected function forget(User $user, string $productName): int
     {
         return ProductoHistorial::where('user_id', $user->id)
killedBy: Tests\Unit\Services\ProductHistoryCleanupServiceTest::test_forget_deletes_only_matching_product
statusReason: 1) Tests\Unit\Services\ProductHistoryCleanupServiceTest::test_forget_deletes_only_matching_product
Error: Call to protected method App\Services\ProductHistoryCleanupService::forget() from scope Tests\Unit\Services\ProductHistoryCleanupServiceTest

I:\proyectos\SuperIA\tests\Unit\Services\ProductHistoryCleanupServiceTest.php:63

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
