[Killed] PublicVisibility
ProductHistoryStatsService.php:41:5
             ->exists();
     }
 
-    public function distinctProductCount(User $user): int
+    protected function distinctProductCount(User $user): int
     {
         return DB::table('producto_historial')
killedBy: Tests\Unit\Services\ProductHistoryStatsServiceTest::test_distinct_product_count
statusReason: 1) Tests\Unit\Services\ProductHistoryStatsServiceTest::test_distinct_product_count
Error: Call to protected method App\Services\ProductHistoryStatsService::distinctProductCount() from scope Tests\Unit\Services\ProductHistoryStatsServiceTest

I:\proyectos\SuperIA\tests\Unit\Services\ProductHistoryStatsServiceTest.php:105

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
