[Killed] PublicVisibility
ProductHistoryWeightingService.php:45:5
         ))->all();
     }
 
-    public function rankedListPaginated(User $user, int $perPage = 20): LengthAwarePaginator
+    protected function rankedListPaginated(User $user, int $perPage = 20): LengthAwarePaginator
     {
         return $this->baseRankedQuery($user)->paginate($perPage);
killedBy: Tests\Unit\Services\ProductHistoryWeightingServiceTest::test_ranked_list_paginated_orders_by_weighted_score
statusReason: 1) Tests\Unit\Services\ProductHistoryWeightingServiceTest::test_ranked_list_paginated_orders_by_weighted_score
Error: Call to protected method App\Services\ProductHistoryWeightingService::rankedListPaginated() from scope Tests\Unit\Services\ProductHistoryWeightingServiceTest

I:\proyectos\SuperIA\tests\Unit\Services\ProductHistoryWeightingServiceTest.php:118

ERRORS!
Tests: 1, Assertions: 0, Error

[Killed] IncrementInteger
ProductHistoryWeightingService.php:45:5
         ))->all();
     }
 
-    public function rankedListPaginated(User $user, int $perPage = 20): LengthAwarePaginator
+    public function rankedListPaginated(User $user, int $perPage = 21): LengthAwarePaginator
     {
         return $this->baseRankedQuery($user)->paginate($perPage);
killedBy: Tests\Unit\Services\ProductHistoryWeightingServiceTest::test_ranked_list_paginated_defaults_to_20_per_page
statusReason: 1) Tests\Unit\Services\ProductHistoryWeightingServiceTest::test_ranked_list_paginated_defaults_to_20_per_page
Failed asserting that 21 is identical to 20.

I:\proyectos\SuperIA\tests\Unit\Services\ProductHistoryWeightingServiceTest.php:148

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.
