[Survived] ReturnRemoval
ReplenishmentSuggestionService.php:98:13
             ->get();
 
         if ($rows->isEmpty()) {
-            return [];
+            
         }
 

[Killed] Continue_
ReplenishmentSuggestionService.php:114:17
         foreach ($rows as $row) {
             $key = mb_strtolower($row->producto_nombre);
             if (isset($excluded[$key])) {
-                continue;
+                break;
             }
 
killedBy: Tests\Unit\Services\ReplenishmentSuggestionServiceTest::test_excluded_product_does_not_stop_iteration_of_remaining
statusReason: 1) Tests\Unit\Services\ReplenishmentSuggestionServiceTest::test_excluded_product_does_not_stop_iteration_of_remaining
Failed asserting that an array contains 'Pan'.

I:\proyectos\SuperIA\tests\Unit\Services\ReplenishmentSuggestionServiceTest.php:335

FAILURES!
Tests: 5, Assertions: 5, Failures: 1.
