[Killed] PublicVisibility
StatsService.php:12:5
 
 class StatsService
 {
-    public function getStats(User $user): array
+    protected function getStats(User $user): array
     {
         $totalCompleted = $user->shoppingLists()
killedBy: Tests\Feature\StatsControllerTest::test_stats_returns_data_when_enough_lists
statusReason: 1) Tests\Feature\StatsControllerTest::test_stats_returns_data_when_enough_lists
Expected response status code [200] but received 500.
Failed asserting that 500 is identical to 200.

The following exception occurred during the last request:

Error: Call to protected method App\Services\StatsService::getStats() from scope App\Http\Controllers\StatsController in I:\proyectos\SuperIA\app\Http\Controll

[Killed] GreaterThanOrEqualToNegotiation
StatsService.php:18:9
             ->where('status', ListStatus::Archived)
             ->count();
 
-        $hasEnoughData = $totalCompleted >= 3;
+        $hasEnoughData = $totalCompleted < 3;
 
         return [
killedBy: Tests\Feature\StatsControllerTest::test_stats_returns_data_when_enough_lists
statusReason: 1) Tests\Feature\StatsControllerTest::test_stats_returns_data_when_enough_lists
Failed asserting that false is identical to true.

I:\proyectos\SuperIA\vendor\laravel\framework\src\Illuminate\Testing\AssertableJsonString.php:243
I:\proyectos\SuperIA\vendor\laravel\framework\src\Illuminate\Testing\TestResponse.php:879
I:\proyectos\SuperIA\tests\Feature\StatsControllerTest.php:35

FAILURES!

[Killed] GreaterThanOrEqualTo
StatsService.php:18:9
             ->where('status', ListStatus::Archived)
             ->count();
 
-        $hasEnoughData = $totalCompleted >= 3;
+        $hasEnoughData = $totalCompleted > 3;
 
         return [
killedBy: Tests\Feature\StatsControllerTest::test_stats_returns_data_when_enough_lists
statusReason: 1) Tests\Feature\StatsControllerTest::test_stats_returns_data_when_enough_lists
Failed asserting that false is identical to true.

I:\proyectos\SuperIA\vendor\laravel\framework\src\Illuminate\Testing\AssertableJsonString.php:243
I:\proyectos\SuperIA\vendor\laravel\framework\src\Illuminate\Testing\TestResponse.php:879
I:\proyectos\SuperIA\tests\Feature\StatsControllerTest.php:35

FAILURES!

[Killed] Ternary
StatsService.php:23:13
         return [
             'total_lists_completed' => $totalCompleted,
             'has_enough_data' => $hasEnoughData,
-            'monthly_spend' => $hasEnoughData ? $this->monthlySpend($user) : [],
+            'monthly_spend' => $hasEnoughData ? [] : $this->monthlySpend($user),
             'top_categories' => $hasEnoughData ? $this->topCategories($user) : [],
             'top_products' => $hasEnoughData ? $this->topProducts($user) : [],
killedBy: Tests\Unit\Services\StatsServiceTest::test_monthly_spend_is_filled_when_enough_data
statusReason: 1) Tests\Unit\Services\StatsServiceTest::test_monthly_spend_is_filled_when_enough_data
Failed asserting that an array is not empty.

I:\proyectos\SuperIA\tests\Unit\Services\StatsServiceTest.php:37

FAILURES!
Tests: 5, Assertions: 13, Failures: 1.

[Killed] Ternary
StatsService.php:24:13
             'total_lists_completed' => $totalCompleted,
             'has_enough_data' => $hasEnoughData,
             'monthly_spend' => $hasEnoughData ? $this->monthlySpend($user) : [],
-            'top_categories' => $hasEnoughData ? $this->topCategories($user) : [],
+            'top_categories' => $hasEnoughData ? [] : $this->topCategories($user),
             'top_products' => $hasEnoughData ? $this->topProducts($user) : [],
         ];
killedBy: Tests\Unit\Services\StatsServiceTest::test_top_categories_is_filled_when_enough_data
statusReason: 1) Tests\Unit\Services\StatsServiceTest::test_top_categories_is_filled_when_enough_data
Failed asserting that an array is not empty.

I:\proyectos\SuperIA\tests\Unit\Services\StatsServiceTest.php:47

FAILURES!
Tests: 6, Assertions: 14, Failures: 1.

[Killed] Ternary
StatsService.php:25:13
             'has_enough_data' => $hasEnoughData,
             'monthly_spend' => $hasEnoughData ? $this->monthlySpend($user) : [],
             'top_categories' => $hasEnoughData ? $this->topCategories($user) : [],
-            'top_products' => $hasEnoughData ? $this->topProducts($user) : [],
+            'top_products' => $hasEnoughData ? [] : $this->topProducts($user),
         ];
     }
killedBy: Tests\Unit\Services\StatsServiceTest::test_top_products_is_filled_when_enough_data
statusReason: 1) Tests\Unit\Services\StatsServiceTest::test_top_products_is_filled_when_enough_data
Failed asserting that an array is not empty.

I:\proyectos\SuperIA\tests\Unit\Services\StatsServiceTest.php:57

FAILURES!
Tests: 7, Assertions: 15, Failures: 1.

[Killed] DecrementInteger
StatsService.php:31:9
 
     private function monthlySpend(User $user): array
     {
-        $sixMonthsAgo = Carbon::now()->subMonths(6)->startOfMonth();
+        $sixMonthsAgo = Carbon::now()->subMonths(5)->startOfMonth();
 
         return DB::table('shopping_lists as sl')
killedBy: Tests\Unit\Services\StatsServiceTest::test_monthly_spend_includes_data_from_6_months_ago
statusReason: 1) Tests\Unit\Services\StatsServiceTest::test_monthly_spend_includes_data_from_6_months_ago
Failed asserting that an array is not empty.

I:\proyectos\SuperIA\tests\Unit\Services\StatsServiceTest.php:81

FAILURES!
Tests: 6, Assertions: 9, Failures: 1.

[Killed] IncrementInteger
StatsService.php:31:9
 
     private function monthlySpend(User $user): array
     {
-        $sixMonthsAgo = Carbon::now()->subMonths(6)->startOfMonth();
+        $sixMonthsAgo = Carbon::now()->subMonths(7)->startOfMonth();
 
         return DB::table('shopping_lists as sl')
killedBy: Tests\Unit\Services\StatsServiceTest::test_monthly_spend_excludes_data_older_than_6_months
statusReason: 1) Tests\Unit\Services\StatsServiceTest::test_monthly_spend_excludes_data_older_than_6_months
Failed asserting that an array does not contain '2025-09'.

I:\proyectos\SuperIA\tests\Unit\Services\StatsServiceTest.php:96

FAILURES!
Tests: 7, Assertions: 10, Failures: 1.

[Killed] CastFloat
StatsService.php:47:13
             ->groupBy('month')
             ->orderBy('month')
             ->get()
-            ->map(fn ($row) => ['month' => $row->month, 'total' => (float) $row->total])
+            ->map(fn ($row) => ['month' => $row->month, 'total' => $row->total])
             ->all();
     }
killedBy: Tests\Unit\Services\StatsServiceTest::test_monthly_spend_total_is_float
statusReason: 1) Tests\Unit\Services\StatsServiceTest::test_monthly_spend_total_is_float
Failed asserting that '2.50' is of type float.

I:\proyectos\SuperIA\tests\Unit\Services\StatsServiceTest.php:120

FAILURES!
Tests: 9, Assertions: 13, Failures: 1.

[Killed] ArrayItemRemoval
StatsService.php:47:13
             ->groupBy('month')
             ->orderBy('month')
             ->get()
-            ->map(fn ($row) => ['month' => $row->month, 'total' => (float) $row->total])
+            ->map(fn ($row) => ['total' => (float) $row->total])
             ->all();
     }
killedBy: Tests\Unit\Services\StatsServiceTest::test_monthly_spend_entry_has_month_and_total_keys
statusReason: 1) Tests\Unit\Services\StatsServiceTest::test_monthly_spend_entry_has_month_and_total_keys
Failed asserting that an array has the key 'month'.

I:\proyectos\SuperIA\tests\Unit\Services\StatsServiceTest.php:108

FAILURES!
Tests: 8, Assertions: 11, Failures: 1.

[Killed] Identical
StatsService.php:57:9
             ->where('user_id', $user->id)
             ->count();
 
-        if ($total === 0) {
+        if ($total !== 0) {
             return [];
         }
killedBy: Tests\Unit\Services\StatsServiceTest::test_top_categories_is_filled_when_enough_data
statusReason: 1) Tests\Unit\Services\StatsServiceTest::test_top_categories_is_filled_when_enough_data
Failed asserting that an array is not empty.

I:\proyectos\SuperIA\tests\Unit\Services\StatsServiceTest.php:47

FAILURES!
Tests: 4, Assertions: 7, Failures: 1.

[Survived] DecrementInteger
StatsService.php:57:9
             ->where('user_id', $user->id)
             ->count();
 
-        if ($total === 0) {
+        if ($total === -1) {
             return [];
         }

[Survived] ReturnRemoval
StatsService.php:58:13
             ->count();
 
         if ($total === 0) {
-            return [];
+            
         }
 

[Killed] DecrementInteger
StatsService.php:67:13
             ->selectRaw('categoria as category, COUNT(*) as count')
             ->groupBy('categoria')
             ->orderByDesc('count')
-            ->limit(5)
+            ->limit(4)
             ->get()
             ->map(fn ($row) => [
killedBy: Tests\Unit\Services\StatsServiceTest::test_top_categories_limits_to_5
statusReason: 1) Tests\Unit\Services\StatsServiceTest::test_top_categories_limits_to_5
Failed asserting that actual size 4 matches expected size 5.

I:\proyectos\SuperIA\tests\Unit\Services\StatsServiceTest.php:135

FAILURES!
Tests: 5, Assertions: 8, Failures: 1.

[Killed] IncrementInteger
StatsService.php:67:13
             ->selectRaw('categoria as category, COUNT(*) as count')
             ->groupBy('categoria')
             ->orderByDesc('count')
-            ->limit(5)
+            ->limit(6)
             ->get()
             ->map(fn ($row) => [
killedBy: Tests\Unit\Services\StatsServiceTest::test_top_categories_limits_to_5
statusReason: 1) Tests\Unit\Services\StatsServiceTest::test_top_categories_limits_to_5
Failed asserting that actual size 6 matches expected size 5.

I:\proyectos\SuperIA\tests\Unit\Services\StatsServiceTest.php:135

FAILURES!
Tests: 5, Assertions: 8, Failures: 1.

[Survived] CastInt
StatsService.php:71:17
             ->get()
             ->map(fn ($row) => [
                 'category' => $row->category,
-                'count' => (int) $row->count,
+                'count' => $row->count,
                 'percentage' => round(((int) $row->count / $total) * 100, 1),
             ])

[Killed] DecrementInteger
StatsService.php:72:17
             ->map(fn ($row) => [
                 'category' => $row->category,
                 'count' => (int) $row->count,
-                'percentage' => round(((int) $row->count / $total) * 100, 1),
+                'percentage' => round(((int) $row->count / $total) * 100, 0),
             ])
             ->all();
killedBy: Tests\Unit\Services\StatsServiceTest::test_top_categories_percentage_uses_division_and_rounds_to_1_decimal
statusReason: 1) Tests\Unit\Services\StatsServiceTest::test_top_categories_percentage_uses_division_and_rounds_to_1_decimal
Failed asserting that 33.0 is identical to 33.3.

I:\proyectos\SuperIA\tests\Unit\Services\StatsServiceTest.php:171

FAILURES!
Tests: 8, Assertions: 13, Failures: 1.

[Killed] RoundingFamily
StatsService.php:72:17
             ->map(fn ($row) => [
                 'category' => $row->category,
                 'count' => (int) $row->count,
-                'percentage' => round(((int) $row->count / $total) * 100, 1),
+                'percentage' => floor(((int) $row->count / $total) * 100),
             ])
             ->all();
killedBy: Tests\Unit\Services\StatsServiceTest::test_top_categories_percentage_uses_division_and_rounds_to_1_decimal
statusReason: 1) Tests\Unit\Services\StatsServiceTest::test_top_categories_percentage_uses_division_and_rounds_to_1_decimal
Failed asserting that 33.0 is identical to 33.3.

I:\proyectos\SuperIA\tests\Unit\Services\StatsServiceTest.php:171

FAILURES!
Tests: 8, Assertions: 13, Failures: 1.

[Killed] DecrementInteger
StatsService.php:84:13
             ->selectRaw('producto_nombre as name, COUNT(*) as count')
             ->groupBy('producto_nombre')
             ->orderByDesc('count')
-            ->limit(10)
+            ->limit(9)
             ->get()
             ->map(fn ($row) => ['name' => $row->name, 'count' => (int) $row->count])
killedBy: Tests\Unit\Services\StatsServiceTest::test_top_products_limits_to_exactly_10
statusReason: 1) Tests\Unit\Services\StatsServiceTest::test_top_products_limits_to_exactly_10
Failed asserting that actual size 9 matches expected size 10.

I:\proyectos\SuperIA\tests\Unit\Services\StatsServiceTest.php:195

FAILURES!
Tests: 15, Assertions: 21, Failures: 1.

[Killed] IncrementInteger
StatsService.php:84:13
             ->selectRaw('producto_nombre as name, COUNT(*) as count')
             ->groupBy('producto_nombre')
             ->orderByDesc('count')
-            ->limit(10)
+            ->limit(11)
             ->get()
             ->map(fn ($row) => ['name' => $row->name, 'count' => (int) $row->count])
killedBy: Tests\Feature\StatsControllerTest::test_stats_top_products_returns_up_to_10
statusReason: 1) Tests\Feature\StatsControllerTest::test_stats_top_products_returns_up_to_10
Failed asserting that 11 is equal to 10 or is less than 10.

I:\proyectos\SuperIA\tests\Feature\StatsControllerTest.php:68

FAILURES!
Tests: 2, Assertions: 5, Failures: 1.

[Survived] CastInt
StatsService.php:86:13
             ->orderByDesc('count')
             ->limit(10)
             ->get()
-            ->map(fn ($row) => ['name' => $row->name, 'count' => (int) $row->count])
+            ->map(fn ($row) => ['name' => $row->name, 'count' => $row->count])
             ->all();
     }

[Killed] ArrayItemRemoval
StatsService.php:86:13
             ->orderByDesc('count')
             ->limit(10)
             ->get()
-            ->map(fn ($row) => ['name' => $row->name, 'count' => (int) $row->count])
+            ->map(fn ($row) => ['count' => (int) $row->count])
             ->all();
     }
killedBy: Tests\Unit\Services\StatsServiceTest::test_top_products_entry_has_name_and_count_keys
statusReason: 1) Tests\Unit\Services\StatsServiceTest::test_top_products_entry_has_name_and_count_keys
Failed asserting that an array has the key 'name'.

I:\proyectos\SuperIA\tests\Unit\Services\StatsServiceTest.php:206

FAILURES!
Tests: 16, Assertions: 22, Failures: 1.
