[Killed] PublicVisibility
WaitlistService.php:54:5
         ];
     }
 
-    public function invite(WaitlistEntry $entry): void
+    protected function invite(WaitlistEntry $entry): void
     {
         if (!$entry->isPending()) {
killedBy: Tests\Unit\Services\WaitlistServiceTest::test_invite_sends_email_and_updates_entry
statusReason: 1) Tests\Unit\Services\WaitlistServiceTest::test_invite_sends_email_and_updates_entry
Error: Call to protected method App\Services\WaitlistService::invite() from scope Tests\Unit\Services\WaitlistServiceTest

I:\proyectos\SuperIA\tests\Unit\Services\WaitlistServiceTest.php:105

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] LogicalNot
WaitlistService.php:56:9
 
     public function invite(WaitlistEntry $entry): void
     {
-        if (!$entry->isPending()) {
+        if ($entry->isPending()) {
             throw new \InvalidArgumentException('Solo se pueden invitar entradas pendientes.');
         }
killedBy: Tests\Unit\Services\WaitlistServiceTest::test_invite_sends_email_and_updates_entry
statusReason: 1) Tests\Unit\Services\WaitlistServiceTest::test_invite_sends_email_and_updates_entry
InvalidArgumentException: Solo se pueden invitar entradas pendientes.

I:\proyectos\SuperIA\app\Services\WaitlistService.php:57
I:\proyectos\SuperIA\tests\Unit\Services\WaitlistServiceTest.php:105

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Throw_
WaitlistService.php:57:13
     public function invite(WaitlistEntry $entry): void
     {
         if (!$entry->isPending()) {
-            throw new \InvalidArgumentException('Solo se pueden invitar entradas pendientes.');
+            new \InvalidArgumentException('Solo se pueden invitar entradas pendientes.');
         }
 
killedBy: Tests\Unit\Services\WaitlistServiceTest::test_invite_throws_if_not_pending
statusReason: 1) Tests\Unit\Services\WaitlistServiceTest::test_invite_throws_if_not_pending
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] ConcatOperandRemoval
WaitlistService.php:60:9
             throw new \InvalidArgumentException('Solo se pueden invitar entradas pendientes.');
         }
 
-        $token = hash_hmac('sha256', $entry->email . Str::random(32), config('app.key'));
+        $token = hash_hmac('sha256', $entry->email, config('app.key'));
         $expiresAt = now()->addDays(7);
 
killedBy: Tests\Unit\Services\WaitlistServiceTest::test_invitation_token_is_not_deterministic_for_same_email
statusReason: 1) Tests\Unit\Services\WaitlistServiceTest::test_invitation_token_is_not_deterministic_for_same_email
Failed asserting that two strings are not identical.

I:\proyectos\SuperIA\tests\Unit\Services\WaitlistServiceTest.php:259

FAILURES!
Tests: 4, Assertions: 9, Failures: 1.

[Survived] DecrementInteger
WaitlistService.php:60:9
             throw new \InvalidArgumentException('Solo se pueden invitar entradas pendientes.');
         }
 
-        $token = hash_hmac('sha256', $entry->email . Str::random(32), config('app.key'));
+        $token = hash_hmac('sha256', $entry->email . Str::random(31), config('app.key'));
         $expiresAt = now()->addDays(7);
 

[Killed] DecrementInteger
WaitlistService.php:61:9
         }
 
         $token = hash_hmac('sha256', $entry->email . Str::random(32), config('app.key'));
-        $expiresAt = now()->addDays(7);
+        $expiresAt = now()->addDays(6);
 
         DB::transaction(function () use ($entry, $token, $expiresAt) {
killedBy: Tests\Unit\Services\WaitlistServiceTest::test_invitation_expires_in_exactly_7_days
statusReason: 1) Tests\Unit\Services\WaitlistServiceTest::test_invitation_expires_in_exactly_7_days
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'2026-04-30'
+'2026-04-29'

[Killed] IncrementInteger
WaitlistService.php:61:9
         }
 
         $token = hash_hmac('sha256', $entry->email . Str::random(32), config('app.key'));
-        $expiresAt = now()->addDays(7);
+        $expiresAt = now()->addDays(8);
 
         DB::transaction(function () use ($entry, $token, $expiresAt) {
killedBy: Tests\Unit\Services\WaitlistServiceTest::test_invitation_expires_in_exactly_7_days
statusReason: 1) Tests\Unit\Services\WaitlistServiceTest::test_invitation_expires_in_exactly_7_days
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'2026-04-30'
+'2026-05-01'

[Killed] MethodCallRemoval
WaitlistService.php:63:9
         $token = hash_hmac('sha256', $entry->email . Str::random(32), config('app.key'));
         $expiresAt = now()->addDays(7);
 
-        DB::transaction(function () use ($entry, $token, $expiresAt) {
-            $entry->update([
-                'status' => 'invited',
-                'invitation_token' => $token,
-                'invitation_sent_at' => now(),
-                'invitation_expires_at' => $expiresAt,
-            ]);
-        });
+        
 
         Mail::to($entry->email)->queue(
killedBy: Tests\Unit\Services\WaitlistServiceTest::test_invite_sends_email_and_updates_entry
statusReason: 1) Tests\Unit\Services\WaitlistServiceTest::test_invite_sends_email_and_updates_entry
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'invited'
+'pending'

[Killed] MethodCallRemoval
WaitlistService.php:64:13
         $expiresAt = now()->addDays(7);
 
         DB::transaction(function () use ($entry, $token, $expiresAt) {
-            $entry->update([
-                'status' => 'invited',
-                'invitation_token' => $token,
-                'invitation_sent_at' => now(),
-                'invitation_expires_at' => $expiresAt,
-            ]);
+            
         });
 
killedBy: Tests\Unit\Services\WaitlistServiceTest::test_invite_sends_email_and_updates_entry
statusReason: 1) Tests\Unit\Services\WaitlistServiceTest::test_invite_sends_email_and_updates_entry
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'invited'
+'pending'

[Killed] MethodCallRemoval
WaitlistService.php:72:9
             ]);
         });
 
-        Mail::to($entry->email)->queue(
-            new InvitationMail($entry->name, $token, $expiresAt)
-        );
+        
     }
 
killedBy: Tests\Unit\Services\WaitlistServiceTest::test_invite_sends_email_and_updates_entry
statusReason: 1) Tests\Unit\Services\WaitlistServiceTest::test_invite_sends_email_and_updates_entry
The expected [App\Mail\InvitationMail] mailable was not queued.
Failed asserting that false is true.

I:\proyectos\SuperIA\vendor\laravel\framework\src\Illuminate\Support\Testing\Fakes\MailFake.php:215
I:\proyectos\SuperIA\vendor\laravel\framework\src\Illuminate\Support\Facades\Facade.php:363
I:\proyectos\SuperIA

[Killed] Foreach_
WaitlistService.php:98:9
             return;
         }
 
-        foreach ($admins as $admin) {
-            Mail::to($admin->email)->queue(
-                new AdminWaitlistNotificationMail($name, $email, $position)
-            );
-        }
+        foreach ([] as $admin) {
     }
 
killedBy: Tests\Unit\Services\WaitlistServiceTest::test_register_notifies_admin_on_new_entry
statusReason: 1) Tests\Unit\Services\WaitlistServiceTest::test_register_notifies_admin_on_new_entry
The expected [App\Mail\AdminWaitlistNotificationMail] mailable was not queued.
Failed asserting that false is true.

I:\proyectos\SuperIA\vendor\laravel\framework\src\Illuminate\Support\Testing\Fakes\MailFake.php:215
I:\proyectos\SuperIA\vendor\laravel\framework\src\Illuminate\Support\Facades\Facade.php:363
I:\pr

[Killed] MethodCallRemoval
WaitlistService.php:99:13
         }
 
         foreach ($admins as $admin) {
-            Mail::to($admin->email)->queue(
-                new AdminWaitlistNotificationMail($name, $email, $position)
-            );
+            
         }
     }
killedBy: Tests\Unit\Services\WaitlistServiceTest::test_register_notifies_admin_on_new_entry
statusReason: 1) Tests\Unit\Services\WaitlistServiceTest::test_register_notifies_admin_on_new_entry
The expected [App\Mail\AdminWaitlistNotificationMail] mailable was not queued.
Failed asserting that false is true.

I:\proyectos\SuperIA\vendor\laravel\framework\src\Illuminate\Support\Testing\Fakes\MailFake.php:215
I:\proyectos\SuperIA\vendor\laravel\framework\src\Illuminate\Support\Facades\Facade.php:363
I:\pr
