[Killed] MethodCallRemoval
WeeklySummaryService.php:104:13
         }
 
         if (! $this->budgetCap->canSpend()) {
-            $this->usageTracker->record($user, AiOperation::Summary, AiUsageStatus::BudgetCapped);
+            
             $this->budgetCap->notifyIfExceeded();
             return $this->persistFailed($user, $weekStart, 'global budget exceeded');
killedBy: Tests\Unit\Services\WeeklySummaryServiceTest::test_generate_budget_exceeded_records_budget_capped_in_log
statusReason: 1) Tests\Unit\Services\WeeklySummaryServiceTest::test_generate_budget_exceeded_records_budget_capped_in_log
Failed asserting that a row in the table [ai_usage_log] matches the attributes {
    "user_id": 31136,
    "status": "budget_capped",
    "operation": "summary"
}.

Found similar results: [

[Survived] MethodCallRemoval
WeeklySummaryService.php:105:13
 
         if (! $this->budgetCap->canSpend()) {
             $this->usageTracker->record($user, AiOperation::Summary, AiUsageStatus::BudgetCapped);
-            $this->budgetCap->notifyIfExceeded();
+            
             return $this->persistFailed($user, $weekStart, 'global budget exceeded');
         }

[Killed] ReturnRemoval
WeeklySummaryService.php:106:13
         if (! $this->budgetCap->canSpend()) {
             $this->usageTracker->record($user, AiOperation::Summary, AiUsageStatus::BudgetCapped);
             $this->budgetCap->notifyIfExceeded();
-            return $this->persistFailed($user, $weekStart, 'global budget exceeded');
+            
         }
 
killedBy: Tests\Unit\Services\WeeklySummaryServiceTest::test_generate_for_user_blocks_when_global_budget_exceeded
statusReason: 1) Tests\Unit\Services\WeeklySummaryServiceTest::test_generate_for_user_blocks_when_global_budget_exceeded
Failed asserting that two variables reference the same object.
--- Expected
+++ Actual
@@ @@
-App\Enums\WeeklySummaryStatus Enum #2709 (Failed, 'failed')
+App\Enums\WeeklySummaryStatus Enum #3137 (Pending, 'pending')

[Killed] MethodCallRemoval
WeeklySummaryService.php:110:13
         }
 
         if (! $this->usageTracker->canUse($user, AiOperation::Summary)) {
-            $this->usageTracker->record($user, AiOperation::Summary, AiUsageStatus::UserCapped);
+            
             return $this->persistFailed($user, $weekStart, 'user quota exceeded');
         }
killedBy: Tests\Unit\Services\WeeklySummaryServiceTest::test_generate_user_quota_exceeded_records_user_capped_in_log
statusReason: 1) Tests\Unit\Services\WeeklySummaryServiceTest::test_generate_user_quota_exceeded_records_user_capped_in_log
Failed asserting that a row in the table [ai_usage_log] matches the attributes {
    "user_id": 31140,
    "status": "user_capped",
    "operation": "summary"
}.

Found similar results: [

[Killed] ReturnRemoval
WeeklySummaryService.php:111:13
 
         if (! $this->usageTracker->canUse($user, AiOperation::Summary)) {
             $this->usageTracker->record($user, AiOperation::Summary, AiUsageStatus::UserCapped);
-            return $this->persistFailed($user, $weekStart, 'user quota exceeded');
+            
         }
 
killedBy: Tests\Unit\Services\WeeklySummaryServiceTest::test_generate_for_user_blocks_when_user_quota_exceeded
statusReason: 1) Tests\Unit\Services\WeeklySummaryServiceTest::test_generate_for_user_blocks_when_user_quota_exceeded
Failed asserting that two variables reference the same object.
--- Expected
+++ Actual
@@ @@
-App\Enums\WeeklySummaryStatus Enum #2659 (Failed, 'failed')
+App\Enums\WeeklySummaryStatus Enum #2643 (Pending, 'pending')

[Killed] ReturnRemoval
WeeklySummaryService.php:183:13
     public function dispatchEmailFor(WeeklySummary $summary): void
     {
         if ($summary->status === WeeklySummaryStatus::Failed) {
-            return;
+            
         }
 
killedBy: Tests\Unit\Services\WeeklySummaryServiceTest::test_dispatch_email_noop_for_failed_summary
statusReason: 1) Tests\Unit\Services\WeeklySummaryServiceTest::test_dispatch_email_noop_for_failed_summary
The following mailables were queued unexpectedly:

- App\Mail\WeeklySummaryMail

Failed asserting that an array is empty.

I:\proyectos\SuperIA\vendor\laravel\framework\src\Illuminate\Support\Testing\Fakes\MailFake.php:283

[Killed] IncrementInteger
WeeklySummaryService.php:219:13
     public function convertToList(User $user, WeeklySummary $summary): ShoppingList
     {
         if ($summary->user_id !== $user->id) {
-            abort(404);
+            abort(405);
         }
 
killedBy: Tests\Unit\Services\WeeklySummaryServiceTest::test_convert_to_list_throws_404_not_403_or_405
statusReason: 1) Tests\Unit\Services\WeeklySummaryServiceTest::test_convert_to_list_throws_404_not_403_or_405
Failed asserting that 405 is identical to 404.

I:\proyectos\SuperIA\tests\Unit\Services\WeeklySummaryServiceTest.php:315

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] DecrementInteger
WeeklySummaryService.php:219:13
     public function convertToList(User $user, WeeklySummary $summary): ShoppingList
     {
         if ($summary->user_id !== $user->id) {
-            abort(404);
+            abort(403);
         }
 
killedBy: Tests\Unit\Services\WeeklySummaryServiceTest::test_convert_to_list_throws_404_not_403_or_405
statusReason: 1) Tests\Unit\Services\WeeklySummaryServiceTest::test_convert_to_list_throws_404_not_403_or_405
Failed asserting that 403 is identical to 404.

I:\proyectos\SuperIA\tests\Unit\Services\WeeklySummaryServiceTest.php:315

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] ReturnRemoval
WeeklySummaryService.php:344:13
     private function persistFailed(User $user, string $weekStart, string $reason): WeeklySummary
     {
         try {
-            return WeeklySummary::create([
-                'user_id' => $user->id,
-                'week_start_date' => $weekStart,
-                'status' => WeeklySummaryStatus::Failed,
-                'error_message' => $reason,
-            ]);
+            
         } catch (QueryException $e) {
             if ($this->isUniqueViolation($e)) {
killedBy: Tests\Unit\Services\WeeklySummaryServiceTest::test_generate_for_user_blocks_when_user_quota_exceeded
statusReason: 1) Tests\Unit\Services\WeeklySummaryServiceTest::test_generate_for_user_blocks_when_user_quota_exceeded
TypeError: App\Services\WeeklySummaryService::persistFailed(): Return value must be of type App\Models\WeeklySummary, none returned

I:\proyectos\SuperIA\app\Services\WeeklySummaryService.php:357
I:\proyectos\SuperIA\app\Services\WeeklySummaryService.php:111
I:\proyectos\SuperIA\tests\Unit\Servi

[Killed] ArrayItem
WeeklySummaryService.php:345:17
     {
         try {
             return WeeklySummary::create([
-                'user_id' => $user->id,
+                'user_id' > $user->id,
                 'week_start_date' => $weekStart,
                 'status' => WeeklySummaryStatus::Failed,
killedBy: Tests\Unit\Services\WeeklySummaryServiceTest::test_generate_for_user_blocks_when_user_quota_exceeded
statusReason: 1) Tests\Unit\Services\WeeklySummaryServiceTest::test_generate_for_user_blocks_when_user_quota_exceeded

I:\proyectos\SuperIA\vendor\laravel\framework\src\Illuminate\Database\Connection.php:838
I:\proyectos\SuperIA\vendor\laravel\framework\src\Illuminate\Database\Connection.php:794
I:\proyectos\SuperIA\vendor\laravel\framework\src\Illuminate\Database\MySqlConnection.php:42
I:\proyectos\SuperIA\ven
